src/Enums/ВидыМаркируемойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыМаркируемойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табачная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыУпаковокМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУпаковокМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Логистическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Групповая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Потребительская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ШтрихкодированиеМПКлиентСервер/Ext/Module.bsl
// Проверяет код маркировки на соответствие шаблону табачной пачки
//
// Параметры:
//   КодМаркировки - Строка - Код маркировки.
//   GTIN          - Строка - GTIN [Возвращаемое значение].
//Возвращаемое значение:
//   Булево - Истина, если код соответствует табачной пачке.
Функция ЭтоКодМаркировкиТабачнойПачки(КодМаркировки, EAN = Неопределено, МРЦ = Неопределено, РезультатРазбора = Неопределено) Экспорт
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Табачная");
	ВидУпаковки  = ПредопределенноеЗначение("Перечисление.ВидыУпаковокМаркировки.Потребительская");
	
	РезультатРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если РезультатРазбора = Неопределено Или РезультатРазбора.ВидУпаковки <> ВидУпаковки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставКодаМаркировки = РезультатРазбора.СоставКодаМаркировки;
	
	EAN = СоставКодаМаркировки.EAN;
	
	Если СоставКодаМаркировки.Свойство("МРЦ") И ЗначениеЗаполнено(СоставКодаМаркировки.МРЦ) Тогда
		МРЦ = СоставКодаМаркировки.МРЦ;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//Проверяет код маркировки на соответствие шаблону блока табачных пачек
//
// Параметры:
//   КодМаркировки - Строка - Код маркировки.
//   GTIN          - Строка - GTIN [Исходящий].
//   МРЦ           - Число  - МРЦ [Исходящий].
//   СерийныйНомер - Строка - Серийный номер [Исходящий].
//Возвращаемое значение:
//   Булево - Истина, если код соответствует блоку табачных пачек.
//
Функция ЭтоКодМаркировкиБлока(КодМаркировки, EAN = Неопределено, МРЦ = Неопределено, СерийныйНомер = Неопределено) Экспорт
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Табачная");
	ВидУпаковки  = ПредопределенноеЗначение("Перечисление.ВидыУпаковокМаркировки.Групповая");
	
	РезультатРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если РезультатРазбора = Неопределено Или РезультатРазбора.ВидУпаковки <> ВидУпаковки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставКодаМаркировки = РезультатРазбора.СоставКодаМаркировки;
	
	EAN           = СоставКодаМаркировки.EAN;
	СерийныйНомер = СоставКодаМаркировки.СерийныйНомер;
	
	Если СоставКодаМаркировки.Свойство("МРЦ") И ЗначениеЗаполнено(СоставКодаМаркировки.МРЦ) Тогда
		МРЦ = СоставКодаМаркировки.МРЦ;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет код маркировки на соответствие шаблону потребительской упаковки
// 
// Параметры:
// 	КодМаркировки - Строка - Код маркировки.
// 	GTIN          - Строка - GTIN [Возвращаемое значение].
// Возвращаемое значение:
// 	Булево - Истина, если код соответствует коробке обуви.
Функция ЭтоКодМаркировкиПотребительскойУпаковки(КодМаркировки, EAN = Неопределено, СерийныйНомер = Неопределено, КодТНВЭД = Неопределено, ДанныеРазбора = Неопределено) Экспорт
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Обувная");
	ВидУпаковки  = ПредопределенноеЗначение("Перечисление.ВидыУпаковокМаркировки.Потребительская");
	
	ДанныеРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если ДанныеРазбора = Неопределено Или ДанныеРазбора.ВидУпаковки <> ВидУпаковки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставКодаМаркировки = ДанныеРазбора.СоставКодаМаркировки;
	
	EAN           = СоставКодаМаркировки.EAN;
	СерийныйНомер = СоставКодаМаркировки.СерийныйНомер;
	
	Если СоставКодаМаркировки.Свойство("КодТНВЭД") И ЗначениеЗаполнено(СоставКодаМаркировки.КодТНВЭД) Тогда
		КодТНВЭД = СоставКодаМаркировки.КодТНВЭД;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет код маркировки на соответствие шаблону логистической упаковки
// 
// Параметры:
//  КодМаркировки - Строка - Штрихкод.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует логистической упаковке.
Функция ЭтоКодЛогистическойУпаковки(КодМаркировки, ЗначениеSSCC = Неопределено, ДанныеРазбора = Неопределено) Экспорт
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Обувная");
	ВидУпаковки  = ПредопределенноеЗначение("Перечисление.ВидыУпаковокМаркировки.Логистическая");
	
	ДанныеРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если ДанныеРазбора = Неопределено Или ДанныеРазбора.ВидУпаковки <> ВидУпаковки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставКодаМаркировки = ДанныеРазбора.СоставКодаМаркировки;
	
	ЗначениеSSCC = СоставКодаМаркировки.SSCC;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоКодМаркировкиАлкоПродукции(КодМаркировки) Экспорт
	
	ДлиннаМарки = СтрДлина(КодМаркировки);
	
	Результат = ДлиннаМарки = 150 ИЛИ ДлиннаМарки = 68;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКодУпаковкиАлкоПродукции(КодМаркировки) Экспорт
	
	ДлиннаМарки = СтрДлина(КодМаркировки);
	
	Результат = ДлиннаМарки = 26 ИЛИ ДлиннаМарки = 18;
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку на соответствие алфавиту кода маркировки.
//
// Параметры:
//  Код - Строка - Код маркировки.
//  Алфавит - Строка - перечень допустимых символов.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует алфавиту.
Функция КодСоответствуетАлфавиту(Код, Алфавит) Экспорт
	
	ДлинаКода = СтрДлина(Код);
	
	Индекс = 1;
	Пока Индекс < ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(Код, Индекс, 1);
		
		Если Найти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Вычисляет штрихкод EAN из GTIN.
//
// Параметры:
//  GTIN - Строка - GTIN.
// Возвращаемое значение:
//  Строка - Вычисленное значение EAN.
Функция ШтрихкодEANИзGTIN(GTIN) Экспорт

	// Пытаемся получить штрихкод EAN8 или EAN13 из GTIN.
	Пока Лев(GTIN, 1) = "0" И СтрДлина(GTIN) > 8 Цикл
		GTIN = Сред(GTIN, 2);
	КонецЦикла;

	Возврат GTIN;

КонецФункции

// Дополняет штрихкод EAN лидирующими нулями.
//
// Параметры:
//  ШтрихкодEAN - Строка - Значение штрихкода EAN.
// Возвращаемое значение:
//  Строка - GTIN.
Функция GTINПоШтрихкодуEAN(Знач ШтрихкодEAN) Экспорт

	GTIN = ШтрихкодEAN;
	Пока СтрДлина(GTIN) < 14 Цикл
		GTIN = "0" + GTIN;
	КонецЦикла;

	Возврат GTIN;

КонецФункции

// Убирает разделители идентификаторов "(", ")" из кода маркировки.
// 
// Параметры:
//  КодМаркировки - Строка - Код маркировки.
// Возвращаемое значение:
//  Строка - Код маркировки без разделителей.
Функция КодМаркировкиБезСкобок(КодМаркировки) Экспорт
	
	ЧтениеШтрихкода = ШтрихкодыУпаковокКлиентСервер.ПараметрыШтрихкодаGS1СоСкобками(КодМаркировки);
	Если ЧтениеШтрихкода.Результат <> Неопределено Тогда
		Возврат ШтрихкодыУпаковокКлиентСервер.ШтрихкодGS1(ЧтениеШтрихкода.Результат, Ложь, "");
	КонецЕсли;
	
	Возврат КодМаркировки;
	
КонецФункции

// Расчет контрольной цифры для GTIN-8. 
//
// Параметры:
//  GTIN - Текстовая строка с GTIN-8. Может содержать числа от 0 до 9. 
// 
// Возвращаемое значение:
//   - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN8(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 3;
	
	Для Сч = 1 По 7 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Расчет контрольной цифры для GTIN-12. 
//
// Параметры:
//  GTIN - Текстовая строка с GTIN-12. Может содержать числа от 0 до 9. 
// 
// Возвращаемое значение:
//   - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN12(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 3;
	
	Для Сч = 1 По 11 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Расчет контрольной цифры для GTIN-13. 
//
// Параметры:
//  GTIN - Текстовая строка с GTIN-13. Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//   - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN13(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 1;
	
	Для Сч = 1 По 12 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Расчет контрольной цифры для GTIN-14. 
//
// Параметры:
//  GTIN - Текстовая строка с GTIN-14. Может содержать числа от 0 до 9. 
// 
// Возвращаемое значение:
//   - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN14(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 3;
	
	Для Сч = 1 По 13 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Универсальная функция расчета контрольной цифры GTIN.
// GTIN допускает в формате GTIN-8, GTIN-12, GTIN-13, GTIN-14 c контрольным символом.
//
// Параметры:
//  GTIN - Текстовая строка с GTIN(c контрольным символом). Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//   - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN(Знач GTIN) Экспорт
	
	Сумма = 0;
	ДлиннаGTIN = СтрДлина(GTIN);
	Коэффициент = ?(ДлиннаGTIN % 2 = 0, 3, 1); 
	
	Для Сч = 1 По ДлиннаGTIN - 1 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Функция проверяет корректность GTIN.
// GTIN допускает в формате GTIN-8, GTIN-12, GTIN-13, GTIN-14 c контрольным символом.
//
// Параметры:
//  GTIN - Текстовая строка с GTIN(c контрольным символом). Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//   - Булево  
//
Функция ПроверитьКорректностьGTIN(Знач GTIN) Экспорт
	
	Результат = (СтрДлина(GTIN) = 8) Или (СтрДлина(GTIN) = 12) Или (СтрДлина(GTIN) = 13) Или (СтрДлина(GTIN) = 14);
	Возврат Результат И РассчитатьКонтрольныйСимволGTIN(GTIN) = Прав(GTIN, 1);
	
КонецФункции

// Возвращает сокращенное представление штрихкода маркируемой продукции.
// 
// Параметры:
// 	Штрихкод - Строка - Штрихкод строкой.
// Возвращаемое значение:
// 	Строка - Краткое представление штрихкода маркируемой продукции.
Функция ПредставлениеШтрихкода(Штрихкод) Экспорт
	
	Если ЭтоКодМаркировкиПотребительскойУпаковки(Штрихкод) Тогда
		ПредставлениеШтрихкода = Штрихкод;
	Иначе
		ПредставлениеШтрихкода = ШтрихкодированиеМПКлиентСервер.ПредставлениеШтрихкода(Штрихкод);
	КонецЕсли;
	
	Возврат ПредставлениеШтрихкода;
	
КонецФункции

// Приводит код маркировки к виду, необходимому для системы ИС МП.
// 
// Параметры:
//  КодМаркировки - Строка - Код маркировки до нормализации.
// Возвращаемое значение:
//  Неопределено, Строка - Код маркировки после нормализации.
Функция КодМаркировкиДляПередачиИСМП(КодМаркировки) Экспорт
	
	ЗначениеSSCC = Неопределено;
	Если ЭтоКодМаркировкиПотребительскойУпаковки(КодМаркировки) Тогда
		ЗначениеДляПоиска = КодМаркировкиБезСкобок(
			НормализоватьКодМаркировки(
				КодМаркировки));
	ИначеЕсли ЭтоКодЛогистическойУпаковки(КодМаркировки, ЗначениеSSCC) Тогда
		ЗначениеДляПоиска = ЗначениеSSCC;
	Иначе
		ЗначениеДляПоиска = КодМаркировки;
	КонецЕсли;
	
	Возврат ЗначениеДляПоиска;
	
КонецФункции


// Приводит код маркировки к требуемому виду для обработки.
// 
// Параметры:
//  КодМаркировки - Строка - Код маркировки.
// Возвращаемое значение:
//  Строка - Код маркировки, приведенный к требуемому виду.
Функция НормализоватьКодМаркировки(Знач КодМаркировки) Экспорт
	
	ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Обувная");
	
	РезультатРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
	
	Если РезультатРазбора = Неопределено Тогда
		Возврат КодМаркировки;
	КонецЕсли;
	
	НормализованныйКодМаркировки = ШтрихкодированиеМПВызовСервера.НормализоватьКодМаркировки(
		РезультатРазбора, ВидПродукции);
	
	Возврат НормализованныйКодМаркировки;
	
КонецФункции
